#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan for staging</summary>

```terraform
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_access_key.s3_user will be created
  + resource "aws_iam_access_key" "s3_user" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "receiptly-staging-s3-user"
    }

  # aws_iam_user.s3_user will be created
  + resource "aws_iam_user" "s3_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "receiptly-staging-s3-user"
      + path          = "/applications/"
      + tags          = {
          + "Environment" = "staging"
          + "Project"     = "receiptly"
        }
      + tags_all      = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "receiptly"
        }
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy.s3_access will be created
  + resource "aws_iam_user_policy" "s3_access" {
      + id          = (known after apply)
      + name        = "receiptly-staging-s3-access"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + user        = "receiptly-staging-s3-user"
    }

  # random_password.db_password will be created
  + resource "random_password" "db_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 32
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*()-_=+[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.receipts_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "receiptly-staging-receipts"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "staging"
          + "Project"     = "receiptly"
          + "Purpose"     = "Receipt Image Storage"
        }
      + tags_all                    = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "receiptly"
          + "Purpose"     = "Receipt Image Storage"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.receipts_bucket.aws_s3_bucket_lifecycle_configuration.this[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "this" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "archive-old-receipts"
          + status = "Enabled"

          + expiration {
              + days                         = 365
              + expired_object_delete_marker = false
            }

          + filter {
            }
        }
    }

  # module.receipts_bucket.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.receipts_bucket.aws_s3_bucket_server_side_encryption_configuration.this will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.receipts_bucket.aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.secrets.aws_secretsmanager_secret.this["receiptly/s3/credentials"] will be created
  + resource "aws_secretsmanager_secret" "this" {
      + arn                            = (known after apply)
      + description                    = "S3 access credentials for Receiptly staging"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "receiptly/s3/credentials"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 7
      + tags                           = {
          + "Environment" = "staging"
          + "Project"     = "receiptly"
        }
      + tags_all                       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "receiptly"
        }
    }

  # module.secrets.aws_secretsmanager_secret_version.this["receiptly/s3/credentials"] will be created
  + resource "aws_secretsmanager_secret_version" "this" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + db_secret_name              = "receiptly/database/credentials"
  + db_secret_retrieval_command = "aws secretsmanager get-secret-value --secret-id receiptly/database/credentials --query SecretString --output text | jq -r"
  + receipts_bucket_arn         = (known after apply)
  + receipts_bucket_name        = (known after apply)
  + s3_secret_name              = "receiptly/s3/credentials"
  + s3_secret_retrieval_command = "aws secretsmanager get-secret-value --secret-id receiptly/s3/credentials --query SecretString --output text | jq -r"
  + s3_user_arn                 = (known after apply)
  + s3_user_name                = "receiptly-staging-s3-user"
  + setup_complete              = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @eddykuhan, Action: `pull_request`*